src/config/Reports/ПланФактныйАнализЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>ПланФактныйАнализЗакупок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВВалютеРегламентированногоУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Детализация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДетализацияПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНач</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКон</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/config/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/КатегорииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>КатегорииОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ПланыЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПланыЗакупок</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеСвойства</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЗакупок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Enums/ДетализацияПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ДетализацияПланирования</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатурныеГруппы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвойстваНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Reports/ПланФактныйАнализЗакупок/Ext/ObjectModule.bsl
// В текст для построителя отчета вставляет свойства и категории
Процедура ДобавитьВТекстСвойстваИКатегорииЛокально(ТаблицаПолей, Текст, СтруктураПредставлениеПолей, мСоответствиеНазначений, 
	                                          СтруктураПараметры, ТекстИсточникиСведений="", ТекстПоляКатегорий="", 
	                                          ТекстПоляСвойств="", ТекстПоляСгруппироватьПо = "", 
	                                          ЗаменятьСвойства = "//СВОЙСТВА", ЗаменятьКатегории = "//КАТЕГОРИИ", 
	                                          ЗаменятьСоединения = "//СОЕДИНЕНИЯ", ЗаменятьСгруппироватьПо = "//СГРУППИРОВАТЬПО",
	                                          ИдентификаторыПараметровДляОтборовПоКатегориям = "", ФормироватьПоляДляИтогов = Ложь)

	// Добавляемые фрагменты запроса
	ТекстПоляКатегорийДляГруппировки ="";
	ТекстИсточникиСведений ="";
	ТекстПоляКатегорий = "";
	ТекстПоляСвойств = "";

	ИдентификаторыПараметровДляОтборовПоКатегориям = Новый Структура;

	Индекс = 0;

	Выборка = ПланыВидовХарактеристик.СвойстваОбъектов.Выбрать();
	Пока Выборка.Следующий() Цикл

		Если Выборка.ЭтоГруппа 
			ИЛИ Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;

		Выборка = Выборка;
		НайденнаяСтрока = ТаблицаПолей.Найти(Выборка.НазначениеСвойства, "Назначение");
		Если НайденнаяСтрока <> Неопределено Тогда

			// Для списка всех полей
			Если ФормироватьПоляДляИтогов Тогда
				ТекстПоляСвойств = ТекстПоляСвойств + ",
				|	Свойство"+Индекс+"Значение" + " КАК " + "Свойство"+Индекс+"Значение";
			Иначе
				ТекстПоляСвойств = ТекстПоляСвойств + ",
				|	Свойство"+Индекс+".Значение" + " КАК " + "Свойство"+Индекс+"Значение";
			КонецЕсли; 

			ТекстПоляКатегорийДляГруппировки = ТекстПоляКатегорийДляГруппировки + ",
			|	Свойство"+Индекс+".Значение";

			// Источник для свойств
			ТекстИсточникиСведений = ТекстИсточникиСведений + Символы.ПС + 
			"{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Свойство"+Индекс+"
			|ПО Свойство"+Индекс+".Объект = " + НайденнаяСтрока.ПутьКДанным + "
			|И  Свойство"+Индекс+".Свойство = &ПараметрСвойство"+Индекс+ "}";

			СтруктураПараметры.Вставить("ПараметрСвойство"+Индекс, Выборка.Ссылка);

			СтруктураПредставлениеПолей.Вставить("Свойство"+Индекс+"Значение", Выборка.Наименование + " (св-во " + НайденнаяСтрока.Представление + ")");

			мСоответствиеНазначений.Вставить(Выборка.Наименование + " (св-во " + НайденнаяСтрока.Представление + ")", Выборка.Ссылка);

			Индекс = Индекс + 1;

		КонецЕсли; 

	КонецЦикла;

	Для каждого Строка Из ТаблицаПолей Цикл

		Если НЕ (Строка.НетКатегорий=Истина) Тогда


			ТекстИсточникиСведений = ТекстИсточникиСведений + Символы.ПС + 
			"{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК Категории"+Индекс+"
			|ПО Категории"+Индекс+".Объект = " + Строка.ПутьКДанным + "
			|И  Категории"+Индекс+".Категория В (&ПараметрКатегории"+Индекс+")}";

			ТекстПоляКатегорий = ТекстПоляКатегорий + ",
			|	ВЫБОР
			|		КОГДА Категории"+Индекс+".Категория ЕСТЬ НЕ NULL 
			|			ТОГДА Категории"+Индекс+".Категория
			|	ИНАЧЕ "+Строка.ПутьКДанным + "
			|	КОНЕЦ КАК Категории"+Индекс+"Категория";

			ТекстПоляКатегорийДляГруппировки = ТекстПоляКатегорийДляГруппировки + ",
			|	Категории"+Индекс+".Категория";

			СтруктураПредставлениеПолей.Вставить("Категории"+Индекс+"Категория", "Категории " + Строка.Представление);

			ИдентификаторыПараметровДляОтборовПоКатегориям.Вставить("Категории"+Индекс+"Категория", "ПараметрКатегории"+Индекс);

			мСоответствиеНазначений.Вставить("Категории " + Строка.Представление, Строка.Назначение);

			Индекс = Индекс + 1;

		КонецЕсли; 
	
	КонецЦикла; 

	//ВЫБРАТЬ РАЗЛИЧНЫЕ съедает достаточно много ресурсов - поэтому если 
	//не надо, то обойдемся без него.
	Если ТекстПоляКатегорийДляГруппировки <> "" Тогда

		Текст = СтрЗаменить(Текст, "//РАЗЛИЧНЫЕ", "РАЗЛИЧНЫЕ");

	КонецЕсли;
	Текст = СтрЗаменить(Текст, ЗаменятьСвойства, ТекстПоляСвойств);
	Текст = СтрЗаменить(Текст, ЗаменятьКатегории, ТекстПоляКатегорий);
	Текст = СтрЗаменить(Текст, ЗаменятьСоединения, ТекстИсточникиСведений);
	Текст = СтрЗаменить(Текст, ЗаменятьСгруппироватьПо, ТекстПоляКатегорийДляГруппировки);

КонецПроцедуры

Функция ПолучитьПредставлениеДанных(Данные)
	
	Результат = "";
	
	Если Данные.НомерСтроки = 1 Тогда
		Результат = "Эталонный период.";
	Иначе
		Результат = "Сравниваемый период " + Строка(Данные.НомерСтроки - 1) + ".";
	КонецЕсли;
	
	Результат = Результат + Символы.ПС + Данные.ТипДанных + ". " + Символы.ПС;
	
	Если Данные.ДатаНач = '00010101000000' И Данные.ДатаКон = '00010101000000' Тогда
		Если ОбщийОтчет.ДатаНач = '00010101000000' И ОбщийОтчет.ДатаКон = '00010101000000' Тогда
			Результат = Результат + "Без ограничения периода";
		Иначе
			Результат = Результат + "С " + Формат(ОбщийОтчет.ДатаНач, "ДЛФ=Д; ДП = ""...""") + " по " + Формат(ОбщийОтчет.ДатаКон, "ДЛФ=Д; ДП = ""...""");
		КонецЕсли;
	Иначе
		Результат = Результат + "С " + Формат(Данные.ДатаНач, "ДЛФ=Д; ДП = ""...""") + " по " + Формат(Данные.ДатаКон, "ДЛФ=Д; ДП = ""...""");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьПредставлениеДанных()

Функция ПолучитьТекстЗапроса() Экспорт
	
	Текст = "";
	
	ЭталонныйТипДанных = ДанныеОтчета[0].ТипДанных;
	Если Детализация = Перечисления.ДетализацияПланирования.НоменклатурныеГруппы Тогда
		ПоНоменклатурнымГруппам = Истина;
	Иначе
		ПоНоменклатурнымГруппам = Ложь;
	КонецЕсли;
	
	Для каждого Данные из ДанныеОтчета Цикл
		
		НомерСтроки = Данные.НомерСтроки;
		ТипДанных   = Данные.ТипДанных;
		
		//Планы закупок
		Если ТипДанных = "Планы закупок" Тогда
			
			//Эталонные данные
			Если НомерСтроки = 1 Тогда
				
				Если ПоНоменклатурнымГруппам Тогда
					
					Текст = Текст + "
					|ВЫБРАТЬ //РАЗЛИЧНЫЕ
					|	&ТипДанных" + НомерСтроки + " КАК ТипДанных,
					|	ВЫБОР КОГДА ПланыЗакупокОбороты.Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА
					|			ПланыЗакупокОбороты.Номенклатура.НоменклатурнаяГруппа
					|		ИНАЧЕ
					|			ПланыЗакупокОбороты.Номенклатура
					|		КОНЕЦ
					|	КАК Номенклатура,
					|	СУММА(ПланыЗакупокОбороты.КоличествоОборот) КАК Количество,
					|	СУММА((ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот) * &Коэффициент) КАК Стоимость,
					|	0 КАК КоличествоОтклонение,
					|	0 КАК СтоимостьОтклонение,
					|	0 КАК КоличествоОтклонениеПроцент,
					|	0 КАК СтоимостьОтклонениеПроцент
					|	//СВОЙСТВА_ПЛАНЫЗАКУПОК
					|
					|ИЗ
					|	РегистрНакопления.ПланыЗакупок.Обороты(&ДатаНач" + НомерСтроки + ", &ДатаКон" + НомерСтроки + ",,
					|		ВЫБОР КОГДА Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА Номенклатура.НоменклатурнаяГруппа <> &ПустаяСсылкаНоменклатурнаяГруппа ИНАЧЕ Истина КОНЕЦ
					|		{Номенклатура.* КАК Номенклатура, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, Сценарий.* КАК Сценарий, ДокументПланирования.* КАК ДокументПланирования}
					|	) КАК ПланыЗакупокОбороты
					|	//СОЕДИНЕНИЯ_ПЛАНЫЗАКУПОК
					|
					|{ГДЕ
					|	ПланыЗакупокОбороты.Номенклатура.* КАК Номенклатура
					|	//СВОЙСТВА_ПЛАНЫЗАКУПОК
					|	//КАТЕГОРИИ_ПЛАНЫЗАКУПОК
					|}
					|
					|СГРУППИРОВАТЬ ПО
					|	ВЫБОР КОГДА ПланыЗакупокОбороты.Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА
					|			ПланыЗакупокОбороты.Номенклатура.НоменклатурнаяГруппа
					|		ИНАЧЕ
					|			ПланыЗакупокОбороты.Номенклатура
					|		КОНЕЦ
					|	//СГРУППИРОВАТЬПО_ПЛАНЫЗАКУПОК";
			
				Иначе
					
					Текст = Текст + "
					|ВЫБРАТЬ //РАЗЛИЧНЫЕ
					|	&ТипДанных" + НомерСтроки + " КАК ТипДанных,
					|	ПланыЗакупокОбороты.Номенклатура КАК Номенклатура,
					|	ПланыЗакупокОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
					|	СУММА(ПланыЗакупокОбороты.КоличествоОборот) КАК Количество,
					|	СУММА((ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот) * &Коэффициент) КАК Стоимость,
					|	0 КАК КоличествоОтклонение,
					|	0 КАК СтоимостьОтклонение,
					|	0 КАК КоличествоОтклонениеПроцент,
					|	0 КАК СтоимостьОтклонениеПроцент
					|	//СВОЙСТВА_ПЛАНЫЗАКУПОК
					|
					|ИЗ
					|	РегистрНакопления.ПланыЗакупок.Обороты(&ДатаНач" + НомерСтроки + ", &ДатаКон" + НомерСтроки + ",,
					|		Номенклатура ССЫЛКА Справочник.Номенклатура
					|		{Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, Сценарий.* КАК Сценарий, ДокументПланирования.* КАК ДокументПланирования}
					|	) КАК ПланыЗакупокОбороты
					|	//СОЕДИНЕНИЯ_ПЛАНЫЗАКУПОК
					|
					|{ГДЕ
					|	ПланыЗакупокОбороты.Номенклатура.* КАК Номенклатура,
					|	ПланыЗакупокОбороты.ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры
					|	//СВОЙСТВА_ПЛАНЫЗАКУПОК
					|	//КАТЕГОРИИ_ПЛАНЫЗАКУПОК
					|}
					|
					|СГРУППИРОВАТЬ ПО
					|	ПланыЗакупокОбороты.Номенклатура,
					|	ПланыЗакупокОбороты.ХарактеристикаНоменклатуры
					|	//СГРУППИРОВАТЬПО_ПЛАНЫЗАКУПОК";
					
				КонецЕсли;
				
			//Сравниваемые данные	
			Иначе
				
				Если ПоНоменклатурнымГруппам Тогда
					
					Текст = Текст + "
					|ВЫБРАТЬ //РАЗЛИЧНЫЕ
					|	&ТипДанных" + НомерСтроки + " КАК ТипДанных,
					|	ВЫБОР КОГДА ПланыЗакупокОбороты.Номенклатура ЕСТЬ NULL ТОГДА
					|			ВЫБОР КОГДА ЭталонныеДанные.Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА
					|					ЭталонныеДанные.Номенклатура.НоменклатурнаяГруппа
					|				ИНАЧЕ
					|					ЭталонныеДанные.Номенклатура
					|				КОНЕЦ
					|		ИНАЧЕ
					|			ВЫБОР КОГДА ПланыЗакупокОбороты.Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА
					|					ПланыЗакупокОбороты.Номенклатура.НоменклатурнаяГруппа
					|				ИНАЧЕ
					|					ПланыЗакупокОбороты.Номенклатура
					|				КОНЕЦ
					|		КОНЕЦ
					|	КАК Номенклатура,";
					
				Иначе
					
					Текст = Текст + "
					|ВЫБРАТЬ //РАЗЛИЧНЫЕ
					|	&ТипДанных" + НомерСтроки + " КАК ТипДанных,
					|	ВЫБОР КОГДА ПланыЗакупокОбороты.Номенклатура ЕСТЬ NULL ТОГДА
					|			ЭталонныеДанные.Номенклатура
					|		ИНАЧЕ
					|			ПланыЗакупокОбороты.Номенклатура
					|		КОНЕЦ
					|	КАК Номенклатура,
					|	ВЫБОР КОГДА ПланыЗакупокОбороты.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА
					|			ЭталонныеДанные.ХарактеристикаНоменклатуры
					|		ИНАЧЕ
					|			ПланыЗакупокОбороты.ХарактеристикаНоменклатуры
					|		КОНЕЦ
					|	КАК ХарактеристикаНоменклатуры,";
					
				КонецЕсли;
				
				Если ЭталонныйТипДанных = "Планы закупок" Тогда
					
					Текст = Текст + "
					|	СУММА(ПланыЗакупокОбороты.КоличествоОборот) КАК Количество,
					|	СУММА((ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот) * &Коэффициент) КАК Стоимость,
					|	СУММА(ВЫБОР
					|			КОГДА ЭталонныеДанные.КоличествоОборот ЕСТЬ NULL ТОГДА
					|				ПланыЗакупокОбороты.КоличествоОборот
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПланыЗакупокОбороты.КоличествоОборот ЕСТЬ NULL ТОГДА
					|						- ЭталонныеДанные.КоличествоОборот
					|					ИНАЧЕ
					|						ПланыЗакупокОбороты.КоличествоОборот - ЭталонныеДанные.КоличествоОборот
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК КоличествоОтклонение,
					|	СУММА(ВЫБОР
					|			КОГДА ЭталонныеДанные.СтоимостьОборот + ЭталонныеДанные.НДСОборот ЕСТЬ NULL ТОГДА
					|				(ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот) * &Коэффициент
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот ЕСТЬ NULL ТОГДА
					|						(- ЭталонныеДанные.СтоимостьОборот - ЭталонныеДанные.НДСОборот) * &Коэффициент
					|					ИНАЧЕ
					|						(ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот - ЭталонныеДанные.СтоимостьОборот - ЭталонныеДанные.НДСОборот) * &Коэффициент
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК СтоимостьОтклонение,
					|	МАКСИМУМ(ВЫБОР
					|			КОГДА ЭталонныеДанные.КоличествоОборот ЕСТЬ NULL ИЛИ ЭталонныеДанные.КоличествоОборот = 0 ТОГДА
					|				ВЫБОР
					|					КОГДА ПланыЗакупокОбороты.КоличествоОборот ЕСТЬ NULL ИЛИ ПланыЗакупокОбороты.КоличествоОборот = 0 ТОГДА
					|						0
					|					ИНАЧЕ
					|						100
					|					КОНЕЦ
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПланыЗакупокОбороты.КоличествоОборот ЕСТЬ NULL ИЛИ ПланыЗакупокОбороты.КоличествоОборот = 0 ТОГДА
					|						-100
					|					ИНАЧЕ
					|						(ПланыЗакупокОбороты.КоличествоОборот - ЭталонныеДанные.КоличествоОборот) * 100 / ЭталонныеДанные.КоличествоОборот
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК КоличествоОтклонениеПроцент,
					|	МАКСИМУМ(ВЫБОР
					|			КОГДА ЭталонныеДанные.СтоимостьОборот + ЭталонныеДанные.НДСОборот ЕСТЬ NULL ИЛИ ЭталонныеДанные.СтоимостьОборот + ЭталонныеДанные.НДСОборот = 0 ТОГДА
					|				ВЫБОР
					|					КОГДА ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот ЕСТЬ NULL ИЛИ ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот = 0 ТОГДА
					|						0
					|					ИНАЧЕ
					|						100
					|					КОНЕЦ
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот ЕСТЬ NULL ИЛИ ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот = 0 ТОГДА
					|						-100
					|					ИНАЧЕ
					|						(ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот - ЭталонныеДанные.СтоимостьОборот - ЭталонныеДанные.НДСОборот) * 100 / (ЭталонныеДанные.СтоимостьОборот + ЭталонныеДанные.НДСОборот)
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК СтоимостьОтклонениеПроцент
					|	//СВОЙСТВА_ПЛАНЫЗАКУПОК";
					
					Если ПоНоменклатурнымГруппам Тогда
						
						Текст = Текст + "
						|ИЗ
						|	РегистрНакопления.ПланыЗакупок.Обороты(&ДатаНач" + НомерСтроки + ", &ДатаКон" + НомерСтроки + ",,
						|		ВЫБОР КОГДА Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА Номенклатура.НоменклатурнаяГруппа <> &ПустаяСсылкаНоменклатурнаяГруппа ИНАЧЕ Истина КОНЕЦ
						|		{Номенклатура.* КАК Номенклатура, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, Сценарий.* КАК Сценарий, ДокументПланирования.* КАК ДокументПланирования}
						|	) КАК ПланыЗакупокОбороты
						|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ПланыЗакупок.Обороты(&ДатаНач1, &ДатаКон1,,
						|			ВЫБОР КОГДА Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА Номенклатура.НоменклатурнаяГруппа <> &ПустаяСсылкаНоменклатурнаяГруппа ИНАЧЕ Истина КОНЕЦ
						|			{Номенклатура.* КАК Номенклатура, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, Сценарий.* КАК Сценарий, ДокументПланирования.* КАК ДокументПланирования}
						|		) КАК ЭталонныеДанные
						|			ПО ПланыЗакупокОбороты.Номенклатура = ЭталонныеДанные.Номенклатура
						|	//СОЕДИНЕНИЯ_ПЛАНЫЗАКУПОК";
						
					Иначе
						
						Текст = Текст + "
						|ИЗ
						|	РегистрНакопления.ПланыЗакупок.Обороты(&ДатаНач" + НомерСтроки + ", &ДатаКон" + НомерСтроки + ",,
						|		Номенклатура ССЫЛКА Справочник.Номенклатура
						|		{Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, Сценарий.* КАК Сценарий, ДокументПланирования.* КАК ДокументПланирования}
						|	) КАК ПланыЗакупокОбороты
						|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ПланыЗакупок.Обороты(&ДатаНач1, &ДатаКон1,,
						|			Номенклатура ССЫЛКА Справочник.Номенклатура
						|			{Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, Сценарий.* КАК Сценарий, ДокументПланирования.* КАК ДокументПланирования}
						|		) КАК ЭталонныеДанные
						|			ПО ПланыЗакупокОбороты.Номенклатура = ЭталонныеДанные.Номенклатура
						|			И ПланыЗакупокОбороты.ХарактеристикаНоменклатуры = ЭталонныеДанные.ХарактеристикаНоменклатуры
						|	//СОЕДИНЕНИЯ_ПЛАНЫЗАКУПОК";
						
					КонецЕсли;
					
				ИначеЕсли ЭталонныйТипДанных = "Фактические покупки" Тогда
					
					Текст = Текст + "
					|	СУММА(ПланыЗакупокОбороты.КоличествоОборот) КАК Количество,
					|	СУММА((ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот) * &Коэффициент) КАК Стоимость,
					|	СУММА(ВЫБОР
					|			КОГДА ЭталонныеДанные.КоличествоПриход ЕСТЬ NULL ТОГДА
					|				ПланыЗакупокОбороты.КоличествоОборот
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПланыЗакупокОбороты.КоличествоОборот ЕСТЬ NULL ТОГДА
					|						- ЭталонныеДанные.КоличествоПриход
					|					ИНАЧЕ
					|						ПланыЗакупокОбороты.КоличествоОборот - ЭталонныеДанные.КоличествоПриход
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК КоличествоОтклонение,
					|	СУММА(ВЫБОР
					|			КОГДА ЭталонныеДанные.СтоимостьПриход ЕСТЬ NULL ТОГДА
					|				(ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот) * &Коэффициент
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот ЕСТЬ NULL ТОГДА
					|						(- ЭталонныеДанные.СтоимостьПриход) * &Коэффициент
					|					ИНАЧЕ
					|						(ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот - ЭталонныеДанные.СтоимостьПриход) * &Коэффициент
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК СтоимостьОтклонение,
					|	МАКСИМУМ(ВЫБОР
					|			КОГДА ЭталонныеДанные.КоличествоПриход ЕСТЬ NULL ИЛИ ЭталонныеДанные.КоличествоПриход = 0 ТОГДА
					|				ВЫБОР
					|					КОГДА ПланыЗакупокОбороты.КоличествоОборот ЕСТЬ NULL ИЛИ ПланыЗакупокОбороты.КоличествоОборот = 0 ТОГДА
					|						0
					|					ИНАЧЕ
					|						100
					|					КОНЕЦ
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПланыЗакупокОбороты.КоличествоОборот ЕСТЬ NULL ИЛИ ПланыЗакупокОбороты.КоличествоОборот = 0 ТОГДА
					|						-100
					|					ИНАЧЕ
					|						(ПланыЗакупокОбороты.КоличествоОборот - ЭталонныеДанные.КоличествоПриход) * 100 / ЭталонныеДанные.КоличествоПриход
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК КоличествоОтклонениеПроцент,
					|	МАКСИМУМ(ВЫБОР
					|			КОГДА ЭталонныеДанные.СтоимостьПриход ЕСТЬ NULL ИЛИ ЭталонныеДанные.СтоимостьПриход = 0 ТОГДА
					|				ВЫБОР
					|					КОГДА ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот ЕСТЬ NULL ИЛИ ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот = 0 ТОГДА
					|						0
					|					ИНАЧЕ
					|						100
					|					КОНЕЦ
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот ЕСТЬ NULL ИЛИ ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот = 0 ТОГДА
					|						-100
					|					ИНАЧЕ
					|						(ПланыЗакупокОбороты.СтоимостьОборот + ПланыЗакупокОбороты.НДСОборот - ЭталонныеДанные.СтоимостьПриход) * 100 / ЭталонныеДанные.СтоимостьПриход
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК СтоимостьОтклонениеПроцент";
					
					Если ПоНоменклатурнымГруппам Тогда
						
						Текст = Текст + "
						|ИЗ
						|	РегистрНакопления.ПланыЗакупок.Обороты(&ДатаНач" + НомерСтроки + ", &ДатаКон" + НомерСтроки + ",,
						|		ВЫБОР КОГДА Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА Номенклатура.НоменклатурнаяГруппа <> &ПустаяСсылкаНоменклатурнаяГруппа ИНАЧЕ Истина КОНЕЦ
						|		{Номенклатура.* КАК Номенклатура, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, Сценарий.* КАК Сценарий, ДокументПланирования.* КАК ДокументПланирования}
						|	) КАК ПланыЗакупокОбороты
						|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНач1, &ДатаКон1,,
						|			Номенклатура.НоменклатурнаяГруппа <> &ПустаяСсылкаНоменклатурнаяГруппа
						|			{Номенклатура.* КАК Номенклатура, ДокументОприходования.* КАК ДокументОприходования}
						|		) КАК ЭталонныеДанные
						|			ПО ПланыЗакупокОбороты.Номенклатура = ЭталонныеДанные.Номенклатура
						|	//СОЕДИНЕНИЯ_ПЛАНЫЗАКУПОК";
						
					Иначе
						
						Текст = Текст + "
						|ИЗ
						|	РегистрНакопления.ПланыЗакупок.Обороты(&ДатаНач" + НомерСтроки + ", &ДатаКон" + НомерСтроки + ",,
						|		Номенклатура ССЫЛКА Справочник.Номенклатура
						|		{Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, Сценарий.* КАК Сценарий, ДокументПланирования.* КАК ДокументПланирования}
						|	) КАК ПланыЗакупокОбороты
						|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНач1, &ДатаКон1,,
						|			Номенклатура ССЫЛКА Справочник.Номенклатура
						|			{Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, ДокументОприходования.* КАК ДокументОприходования}
						|		) КАК ЭталонныеДанные
						|			ПО ПланыЗакупокОбороты.Номенклатура = ЭталонныеДанные.Номенклатура
						|			И ПланыЗакупокОбороты.ХарактеристикаНоменклатуры = ЭталонныеДанные.ХарактеристикаНоменклатуры
						|	//СОЕДИНЕНИЯ_ПЛАНЫЗАКУПОК";
						
					КонецЕсли;
					
				КонецЕсли;
				
				
				Если ПоНоменклатурнымГруппам Тогда
					
					Текст = Текст + "
					|
					|{ГДЕ
					|	ПланыЗакупокОбороты.Номенклатура.* КАК Номенклатура
					|	//СВОЙСТВА_ПЛАНЫЗАКУПОК
					|	//КАТЕГОРИИ_ПЛАНЫЗАКУПОК
					|}
					|
					|СГРУППИРОВАТЬ ПО
					|	ВЫБОР КОГДА ПланыЗакупокОбороты.Номенклатура ЕСТЬ NULL ТОГДА
					|			ВЫБОР КОГДА ЭталонныеДанные.Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА
					|					ЭталонныеДанные.Номенклатура.НоменклатурнаяГруппа
					|				ИНАЧЕ
					|					ЭталонныеДанные.Номенклатура
					|				КОНЕЦ
					|		ИНАЧЕ
					|			ВЫБОР КОГДА ПланыЗакупокОбороты.Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА
					|					ПланыЗакупокОбороты.Номенклатура.НоменклатурнаяГруппа
					|				ИНАЧЕ
					|					ПланыЗакупокОбороты.Номенклатура
					|				КОНЕЦ
					|		КОНЕЦ
					|	//СГРУППИРОВАТЬПО_ПЛАНЫЗАКУПОК";
					
				Иначе
					
					Текст = Текст + "
					|
					|{ГДЕ
					|	ПланыЗакупокОбороты.Номенклатура.* КАК Номенклатура
					|	//СВОЙСТВА_ПЛАНЫЗАКУПОК
					|	//КАТЕГОРИИ_ПЛАНЫЗАКУПОК
					|}
					|
					|СГРУППИРОВАТЬ ПО
					|	ВЫБОР КОГДА ПланыЗакупокОбороты.Номенклатура ЕСТЬ NULL ТОГДА
					|			ЭталонныеДанные.Номенклатура
					|		ИНАЧЕ
					|			ПланыЗакупокОбороты.Номенклатура
					|		КОНЕЦ,
					|	ВЫБОР КОГДА ПланыЗакупокОбороты.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА
					|			ЭталонныеДанные.ХарактеристикаНоменклатуры
					|		ИНАЧЕ
					|			ПланыЗакупокОбороты.ХарактеристикаНоменклатуры
					|		КОНЕЦ
					|	//СГРУППИРОВАТЬПО_ПЛАНЫЗАКУПОК";
					
				КонецЕсли;
				
			КонецЕсли;
			
		//Фактические покупки	
		ИначеЕсли Данные.ТипДанных = "Фактические покупки" Тогда
			
			//Эталонные данные
			Если НомерСтроки = 1 Тогда
				
				Если ПоНоменклатурнымГруппам Тогда
					
					Текст = Текст + "
					|ВЫБРАТЬ //РАЗЛИЧНЫЕ
					|	&ТипДанных" + НомерСтроки + " КАК ТипДанных,
					|	ПартииТоваровНаСкладахОбороты.Номенклатура.НоменклатурнаяГруппа	КАК Номенклатура,
					|	СУММА(ПартииТоваровНаСкладахОбороты.КоличествоПриход) КАК Количество,
					|	СУММА(ПартииТоваровНаСкладахОбороты.СтоимостьПриход * &Коэффициент) КАК Стоимость,
					|	0 КАК КоличествоОтклонение,
					|	0 КАК СтоимостьОтклонение,
					|	0 КАК КоличествоОтклонениеПроцент,
					|	0 КАК СтоимостьОтклонениеПроцент
					|	//СВОЙСТВА_ФАКТИЧЕСКИЕПОКУПКИ
					|
					|ИЗ
					|	РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНач" + НомерСтроки + ", &ДатаКон" + НомерСтроки + ",,
					|		Номенклатура.НоменклатурнаяГруппа <> &ПустаяСсылкаНоменклатурнаяГруппа
					|		{Номенклатура.* КАК Номенклатура, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, ДокументОприходования.* КАК ДокументОприходования}
					|	) КАК ПартииТоваровНаСкладахОбороты
					|	//СОЕДИНЕНИЯ_ФАКТИЧЕСКИЕПОКУПКИ
					|
					|{ГДЕ
					|	ПартииТоваровНаСкладахОбороты.Номенклатура.* КАК Номенклатура
					|	//СВОЙСТВА_ФАКТИЧЕСКИЕПОКУПКИ
					|	//КАТЕГОРИИ_ФАКТИЧЕСКИЕПОКУПКИ
					|}
					|
					|СГРУППИРОВАТЬ ПО
					|	ПартииТоваровНаСкладахОбороты.Номенклатура.НоменклатурнаяГруппа
					|	//СГРУППИРОВАТЬПО_ФАКТИЧЕСКИЕПОКУПКИ";
			
				Иначе
					
					Текст = Текст + "
					|ВЫБРАТЬ //РАЗЛИЧНЫЕ
					|	&ТипДанных" + НомерСтроки + " КАК ТипДанных,
					|	ПартииТоваровНаСкладахОбороты.Номенклатура КАК Номенклатура,
					|	ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
					|	СУММА(ПартииТоваровНаСкладахОбороты.КоличествоПриход) КАК Количество,
					|	СУММА(ПартииТоваровНаСкладахОбороты.СтоимостьПриход * &Коэффициент) КАК Стоимость,
					|	0 КАК КоличествоОтклонение,
					|	0 КАК СтоимостьОтклонение,
					|	0 КАК КоличествоОтклонениеПроцент,
					|	0 КАК СтоимостьОтклонениеПроцент
					|	//СВОЙСТВА_ФАКТИЧЕСКИЕПОКУПКИ
					|
					|ИЗ
					|	РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНач" + НомерСтроки + ", &ДатаКон" + НомерСтроки + ",,
					|		Номенклатура ССЫЛКА Справочник.Номенклатура
					|		{Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, ДокументОприходования.* КАК ДокументОприходования}
					|	) КАК ПартииТоваровНаСкладахОбороты
					|	//СОЕДИНЕНИЯ_ФАКТИЧЕСКИЕПОКУПКИ
					|
					|{ГДЕ
					|	ПартииТоваровНаСкладахОбороты.Номенклатура.* КАК Номенклатура,
					|	ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры
					|	//СВОЙСТВА_ФАКТИЧЕСКИЕПОКУПКИ
					|	//КАТЕГОРИИ_ФАКТИЧЕСКИЕПОКУПКИ
					|}
					|
					|СГРУППИРОВАТЬ ПО
					|	ПартииТоваровНаСкладахОбороты.Номенклатура,
					|	ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
					|	//СГРУППИРОВАТЬПО_ФАКТИЧЕСКИЕПОКУПКИ";
					
				КонецЕсли;
				
			//Сравниваемые данные	
			Иначе
				
				Если ПоНоменклатурнымГруппам Тогда
					
					Текст = Текст + "
					|ВЫБРАТЬ //РАЗЛИЧНЫЕ
					|	&ТипДанных" + НомерСтроки + " КАК ТипДанных,
					|	ВЫБОР КОГДА ПартииТоваровНаСкладахОбороты.Номенклатура ЕСТЬ NULL ТОГДА
					|			ВЫБОР КОГДА ЭталонныеДанные.Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА
					|					ЭталонныеДанные.Номенклатура.НоменклатурнаяГруппа
					|				ИНАЧЕ
					|					ЭталонныеДанные.Номенклатура
					|				КОНЕЦ
					|		ИНАЧЕ
					|			ПартииТоваровНаСкладахОбороты.Номенклатура.НоменклатурнаяГруппа
					|		КОНЕЦ
					|	КАК Номенклатура,";
					
				Иначе
					
					Текст = Текст + "
					|ВЫБРАТЬ //РАЗЛИЧНЫЕ
					|	&ТипДанных" + НомерСтроки + " КАК ТипДанных,
					|	ВЫБОР КОГДА ПартииТоваровНаСкладахОбороты.Номенклатура ЕСТЬ NULL ТОГДА
					|			ЭталонныеДанные.Номенклатура
					|		ИНАЧЕ
					|			ПартииТоваровНаСкладахОбороты.Номенклатура
					|		КОНЕЦ
					|	КАК Номенклатура,
					|	ВЫБОР КОГДА ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА
					|			ЭталонныеДанные.ХарактеристикаНоменклатуры
					|		ИНАЧЕ
					|			ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
					|		КОНЕЦ
					|	КАК ХарактеристикаНоменклатуры,";
					
				КонецЕсли;
				
				Если ЭталонныйТипДанных = "Планы закупок" Тогда
					
					Текст = Текст + "
					|	СУММА(ПартииТоваровНаСкладахОбороты.КоличествоПриход) КАК Количество,
					|	СУММА(ПартииТоваровНаСкладахОбороты.СтоимостьПриход * &Коэффициент) КАК Стоимость,
					|	СУММА(ВЫБОР
					|			КОГДА ЭталонныеДанные.КоличествоОборот ЕСТЬ NULL ТОГДА
					|				ПартииТоваровНаСкладахОбороты.КоличествоПриход
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПартииТоваровНаСкладахОбороты.КоличествоПриход ЕСТЬ NULL ТОГДА
					|						- ЭталонныеДанные.КоличествоОборот
					|					ИНАЧЕ
					|						ПартииТоваровНаСкладахОбороты.КоличествоПриход - ЭталонныеДанные.КоличествоОборот
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК КоличествоОтклонение,
					|	СУММА(ВЫБОР
					|			КОГДА ЭталонныеДанные.СтоимостьОборот + ЭталонныеДанные.НДСОборот ЕСТЬ NULL ТОГДА
					|				ПартииТоваровНаСкладахОбороты.СтоимостьПриход * &Коэффициент
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПартииТоваровНаСкладахОбороты.СтоимостьПриход ЕСТЬ NULL ТОГДА
					|						(- ЭталонныеДанные.СтоимостьОборот - ЭталонныеДанные.НДСОборот) * &Коэффициент
					|					ИНАЧЕ
					|						(ПартииТоваровНаСкладахОбороты.СтоимостьПриход - ЭталонныеДанные.СтоимостьОборот - ЭталонныеДанные.НДСОборот) * &Коэффициент
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК СтоимостьОтклонение,
					|	МАКСИМУМ(ВЫБОР
					|			КОГДА ЭталонныеДанные.КоличествоОборот ЕСТЬ NULL ИЛИ ЭталонныеДанные.КоличествоОборот = 0 ТОГДА
					|				ВЫБОР
					|					КОГДА ПартииТоваровНаСкладахОбороты.КоличествоПриход ЕСТЬ NULL ИЛИ ПартииТоваровНаСкладахОбороты.КоличествоПриход = 0 ТОГДА
					|						0
					|					ИНАЧЕ
					|						100
					|					КОНЕЦ
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПартииТоваровНаСкладахОбороты.КоличествоПриход ЕСТЬ NULL ИЛИ ПартииТоваровНаСкладахОбороты.КоличествоПриход = 0 ТОГДА
					|						-100
					|					ИНАЧЕ
					|						(ПартииТоваровНаСкладахОбороты.КоличествоПриход - ЭталонныеДанные.КоличествоОборот) * 100 / ЭталонныеДанные.КоличествоОборот
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК КоличествоОтклонениеПроцент,
					|	МАКСИМУМ(ВЫБОР
					|			КОГДА ЭталонныеДанные.СтоимостьОборот + ЭталонныеДанные.НДСОборот ЕСТЬ NULL ИЛИ ЭталонныеДанные.СтоимостьОборот + ЭталонныеДанные.НДСОборот = 0 ТОГДА
					|				ВЫБОР
					|					КОГДА ПартииТоваровНаСкладахОбороты.СтоимостьПриход ЕСТЬ NULL ИЛИ ПартииТоваровНаСкладахОбороты.СтоимостьПриход = 0 ТОГДА
					|						0
					|					ИНАЧЕ
					|						100
					|					КОНЕЦ
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПартииТоваровНаСкладахОбороты.СтоимостьПриход ЕСТЬ NULL ИЛИ ПартииТоваровНаСкладахОбороты.СтоимостьПриход = 0 ТОГДА
					|						-100
					|					ИНАЧЕ
					|						(ПартииТоваровНаСкладахОбороты.СтоимостьПриход - ЭталонныеДанные.СтоимостьОборот - ЭталонныеДанные.НДСОборот) * 100 / (ЭталонныеДанные.СтоимостьОборот + ЭталонныеДанные.НДСОборот)
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК СтоимостьОтклонениеПроцент
					|	//СВОЙСТВА_ФАКТИЧЕСКИЕПОКУПКИ";
					
					Если ПоНоменклатурнымГруппам Тогда
						
						Текст = Текст + "
						|ИЗ
						|	РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНач" + НомерСтроки + ", &ДатаКон" + НомерСтроки + ",,
						|		Номенклатура.НоменклатурнаяГруппа <> &ПустаяСсылкаНоменклатурнаяГруппа
						|		{Номенклатура.* КАК Номенклатура, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, ДокументОприходования.* КАК ДокументОприходования}
						|	) КАК ПартииТоваровНаСкладахОбороты
						|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ПланыЗакупок.Обороты(&ДатаНач1, &ДатаКон1,,
						|			ВЫБОР КОГДА Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА Номенклатура.НоменклатурнаяГруппа <> &ПустаяСсылкаНоменклатурнаяГруппа ИНАЧЕ Истина КОНЕЦ
						|			{Номенклатура.* КАК Номенклатура, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, Сценарий.* КАК Сценарий, ДокументПланирования.* КАК ДокументПланирования}
						|		) КАК ЭталонныеДанные
						|			ПО ПартииТоваровНаСкладахОбороты.Номенклатура = ЭталонныеДанные.Номенклатура
						|	//СОЕДИНЕНИЯ_ФАКТИЧЕСКИЕПОКУПКИ";
						
					Иначе
						
						Текст = Текст + "
						|ИЗ
						|	РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНач" + НомерСтроки + ", &ДатаКон" + НомерСтроки + ",,
						|		Номенклатура ССЫЛКА Справочник.Номенклатура
						|		{Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, ДокументОприходования.* КАК ДокументОприходования}
						|	) КАК ПартииТоваровНаСкладахОбороты
						|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ПланыЗакупок.Обороты(&ДатаНач1, &ДатаКон1,,
						|			Номенклатура ССЫЛКА Справочник.Номенклатура
						|			{Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, Сценарий.* КАК Сценарий, ДокументПланирования.* КАК ДокументПланирования}
						|		) КАК ЭталонныеДанные
						|			ПО ПартииТоваровНаСкладахОбороты.Номенклатура = ЭталонныеДанные.Номенклатура
						|			И ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры = ЭталонныеДанные.ХарактеристикаНоменклатуры
						|	//СОЕДИНЕНИЯ_ФАКТИЧЕСКИЕПОКУПКИ";
						
					КонецЕсли;
					
				ИначеЕсли ЭталонныйТипДанных = "Фактические покупки" Тогда
					
					Текст = Текст + "
					|	СУММА(ПартииТоваровНаСкладахОбороты.КоличествоПриход) КАК Количество,
					|	СУММА(ПартииТоваровНаСкладахОбороты.СтоимостьПриход * &Коэффициент) КАК Стоимость,
					|	СУММА(ВЫБОР
					|			КОГДА ЭталонныеДанные.КоличествоПриход ЕСТЬ NULL ТОГДА
					|				ПартииТоваровНаСкладахОбороты.КоличествоПриход
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПартииТоваровНаСкладахОбороты.КоличествоПриход ЕСТЬ NULL ТОГДА
					|						- ЭталонныеДанные.КоличествоПриход
					|					ИНАЧЕ
					|						ПартииТоваровНаСкладахОбороты.КоличествоПриход - ЭталонныеДанные.КоличествоПриход
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК КоличествоОтклонение,
					|	СУММА(ВЫБОР
					|			КОГДА ЭталонныеДанные.СтоимостьПриход ЕСТЬ NULL ТОГДА
					|				ПартииТоваровНаСкладахОбороты.СтоимостьПриход * &Коэффициент
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПартииТоваровНаСкладахОбороты.СтоимостьПриход ЕСТЬ NULL ТОГДА
					|						(- ЭталонныеДанные.СтоимостьПриход) * &Коэффициент
					|					ИНАЧЕ
					|						(ПартииТоваровНаСкладахОбороты.СтоимостьПриход - ЭталонныеДанные.СтоимостьПриход) * &Коэффициент
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК СтоимостьОтклонение,
					|	МАКСИМУМ(ВЫБОР
					|			КОГДА ЭталонныеДанные.КоличествоПриход ЕСТЬ NULL ИЛИ ЭталонныеДанные.КоличествоПриход = 0 ТОГДА
					|				ВЫБОР
					|					КОГДА ПартииТоваровНаСкладахОбороты.КоличествоПриход ЕСТЬ NULL ИЛИ ПартииТоваровНаСкладахОбороты.КоличествоПриход = 0 ТОГДА
					|						0
					|					ИНАЧЕ
					|						100
					|					КОНЕЦ
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПартииТоваровНаСкладахОбороты.КоличествоПриход ЕСТЬ NULL ИЛИ ПартииТоваровНаСкладахОбороты.КоличествоПриход = 0 ТОГДА
					|						-100
					|					ИНАЧЕ
					|						(ПартииТоваровНаСкладахОбороты.КоличествоПриход - ЭталонныеДанные.КоличествоПриход) * 100 / ЭталонныеДанные.КоличествоПриход
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК КоличествоОтклонениеПроцент,
					|	МАКСИМУМ(ВЫБОР
					|			КОГДА ЭталонныеДанные.СтоимостьПриход ЕСТЬ NULL ИЛИ ЭталонныеДанные.СтоимостьПриход = 0 ТОГДА
					|				ВЫБОР
					|					КОГДА ПартииТоваровНаСкладахОбороты.СтоимостьПриход ЕСТЬ NULL ИЛИ ПартииТоваровНаСкладахОбороты.СтоимостьПриход = 0 ТОГДА
					|						0
					|					ИНАЧЕ
					|						100
					|					КОНЕЦ
					|			ИНАЧЕ
					|				ВЫБОР
					|					КОГДА ПартииТоваровНаСкладахОбороты.СтоимостьПриход ЕСТЬ NULL ИЛИ ПартииТоваровНаСкладахОбороты.СтоимостьПриход = 0 ТОГДА
					|						-100
					|					ИНАЧЕ
					|						(ПартииТоваровНаСкладахОбороты.СтоимостьПриход - ЭталонныеДанные.СтоимостьПриход) * 100 / ЭталонныеДанные.СтоимостьПриход
					|					КОНЕЦ
					|			КОНЕЦ
					|	) КАК СтоимостьОтклонениеПроцент";
					
					Если ПоНоменклатурнымГруппам Тогда
						
						Текст = Текст + "
						|ИЗ
						|	РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНач" + НомерСтроки + ", &ДатаКон" + НомерСтроки + ",,
						|		Номенклатура.НоменклатурнаяГруппа <> &ПустаяСсылкаНоменклатурнаяГруппа
						|		{Номенклатура.* КАК Номенклатура, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, ДокументОприходования.* КАК ДокументОприходования}
						|	) КАК ПартииТоваровНаСкладахОбороты
						|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНач1, &ДатаКон1,,
						|			Номенклатура.НоменклатурнаяГруппа <> &ПустаяСсылкаНоменклатурнаяГруппа
						|			{Номенклатура.* КАК Номенклатура, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, ДокументОприходования.* КАК ДокументОприходования}
						|		) КАК ЭталонныеДанные
						|			ПО ПартииТоваровНаСкладахОбороты.Номенклатура = ЭталонныеДанные.Номенклатура
						|	//СОЕДИНЕНИЯ_ФАКТИЧЕСКИЕПОКУПКИ";
						
					Иначе
						
						Текст = Текст + "
						|ИЗ
						|	РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНач" + НомерСтроки + ", &ДатаКон" + НомерСтроки + ",,
						|		Номенклатура ССЫЛКА Справочник.Номенклатура
						|		{Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, ДокументОприходования.* КАК ДокументОприходования}
						|	) КАК ПартииТоваровНаСкладахОбороты
						|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНач1, &ДатаКон1,,
						|			Номенклатура ССЫЛКА Справочник.Номенклатура
						|			{Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, ДокументОприходования.* КАК ДокументОприходования}
						|		) КАК ЭталонныеДанные
						|			ПО ПартииТоваровНаСкладахОбороты.Номенклатура = ЭталонныеДанные.Номенклатура
						|			И ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры = ЭталонныеДанные.ХарактеристикаНоменклатуры
						|	//СОЕДИНЕНИЯ_ФАКТИЧЕСКИЕПОКУПКИ";
						
					КонецЕсли;
					
				КонецЕсли;
				
				
				Если ПоНоменклатурнымГруппам Тогда
					
					Текст = Текст + "
					|
					|{ГДЕ
					|	ПартииТоваровНаСкладахОбороты.Номенклатура.* КАК Номенклатура
					|	//СВОЙСТВА_ФАКТИЧЕСКИЕПОКУПКИ
					|	//КАТЕГОРИИ_ФАКТИЧЕСКИЕПОКУПКИ
					|}
					|
					|СГРУППИРОВАТЬ ПО
					|	ВЫБОР КОГДА ПартииТоваровНаСкладахОбороты.Номенклатура ЕСТЬ NULL ТОГДА
					|			ВЫБОР КОГДА ЭталонныеДанные.Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА
					|					ЭталонныеДанные.Номенклатура.НоменклатурнаяГруппа
					|				ИНАЧЕ
					|					ЭталонныеДанные.Номенклатура
					|				КОНЕЦ
					|		ИНАЧЕ
					|			ПартииТоваровНаСкладахОбороты.Номенклатура.НоменклатурнаяГруппа
					|		КОНЕЦ
					|	//СГРУППИРОВАТЬПО_ФАКТИЧЕСКИЕПОКУПКИ";
					
				Иначе
					
					Текст = Текст + "
					|
					|{ГДЕ
					|	ПартииТоваровНаСкладахОбороты.Номенклатура.* КАК Номенклатура,
					|	ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры
					|	//СВОЙСТВА_ФАКТИЧЕСКИЕПОКУПКИ
					|	//КАТЕГОРИИ_ФАКТИЧЕСКИЕПОКУПКИ
					|}
					|
					|СГРУППИРОВАТЬ ПО
					|	ВЫБОР КОГДА ПартииТоваровНаСкладахОбороты.Номенклатура ЕСТЬ NULL ТОГДА
					|			ЭталонныеДанные.Номенклатура
					|		ИНАЧЕ
					|			ПартииТоваровНаСкладахОбороты.Номенклатура
					|		КОНЕЦ,
					|	ВЫБОР КОГДА ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА
					|			ЭталонныеДанные.ХарактеристикаНоменклатуры
					|		ИНАЧЕ
					|			ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
					|		КОНЕЦ
					|	//СГРУППИРОВАТЬПО_ФАКТИЧЕСКИЕПОКУПКИ";
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Данные.НомерСтроки < ДанныеОтчета.Количество() Тогда
			
			Текст = Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеОтчета.Количество() > 0 Тогда
		
		Если ПоНоменклатурнымГруппам Тогда
			
			Текст = Текст + "
			|
			|{УПОРЯДОЧИТЬ ПО
			|	Номенклатура.*
			|	//СВОЙСТВА_ОБЩИЕ
			|}
			|
			|ИТОГИ СУММА(Количество), СУММА(Стоимость), СУММА(КоличествоОтклонение), СУММА(СтоимостьОтклонение), СРЕДНЕЕ(КоличествоОтклонениеПроцент), СРЕДНЕЕ(СтоимостьОтклонениеПроцент)
			|	ПО ОБЩИЕ,
			|	ТипДанных,
			|	Номенклатура ИЕРАРХИЯ
			|	
			|{ИТОГИ ПО
			|	ТипДанных,
			|	Номенклатура.*
			|	//СВОЙСТВА_ОБЩИЕ
			|}
			|";
			
		Иначе
			
			Текст = Текст + "
			|
			|{УПОРЯДОЧИТЬ ПО
			|	Номенклатура.*,
			|	ХарактеристикаНоменклатуры.*
			|	//СВОЙСТВА_ОБЩИЕ
			|}
			|
			|ИТОГИ СУММА(Количество), СУММА(Стоимость), СУММА(КоличествоОтклонение), СУММА(СтоимостьОтклонение), СРЕДНЕЕ(КоличествоОтклонениеПроцент), СРЕДНЕЕ(СтоимостьОтклонениеПроцент)
			|	ПО ОБЩИЕ,
			|	ТипДанных,
			|	Номенклатура ИЕРАРХИЯ,
			|	ХарактеристикаНоменклатуры
			|	
			|{ИТОГИ ПО
			|	ТипДанных,
			|	Номенклатура.*,
			|	ХарактеристикаНоменклатуры.*
			|	//СВОЙСТВА_ОБЩИЕ
			|}
			|";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции // ПолучитьТекстЗапроса()

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	НовСтрока = ДанныеОтчета.Добавить();
	НовСтрока.ТипДанных = "Планы закупок";
	
	НовСтрока = ДанныеОтчета.Добавить();
	НовСтрока.ТипДанных = "Фактические покупки";
	
	Если ДанныеОтчета.Количество() = 0 Тогда
		Предупреждение("Не заполнены данные отчета!");
		Возврат;	
	Иначе
		Для каждого Строка из ДанныеОтчета Цикл
			Если ЗначениеНеЗаполнено(Строка.ТипДанных) Тогда
				Предупреждение("Не заполнен тип в данных отчета!");
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	МассивОтбора = Новый Массив;
	ОбщийОтчет.мСоответствиеНазначений = Новый Соответствие;
	ОбщийОтчет.мСтруктураДляОтбораПоКатегориям = Новый Структура;

	ТекстЗапроса = ПолучитьТекстЗапроса();
	
	СтруктураПредставлениеПолей = Новый Структура(
	"Номенклатура,
	|НоменклатурнаяГруппа,
	|ХарактеристикаНоменклатуры,
	|ДокументПланирования,
	|ДокументОприходования,
	|ТипДанных",
	"Номенклатура",
	"Номенклатурная группа",
	"Характеристика номенклатуры",
	"Документ планирования",
	"Документ оприходования",
	"Источник данных");
	
	Если ОбщийОтчет.ИспользоватьСвойстваИКатегории = Истина Тогда
		
		ТаблицаПолей = Новый ТаблицаЗначений;
		ТаблицаПолей.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляются свойства и
													   // категории. Используется в условии соединения с регистром сведений,
													   // хранящим значения свойств или категорий
		ТаблицаПолей.Колонки.Добавить("Представление");// представление поля, для которого добавляются свойства и категории. 
		ТаблицаПолей.Колонки.Добавить("Назначение");   // назначение свойств/категорий объектов для данного поля
		ТаблицаПолей.Колонки.Добавить("НетКатегорий"); // признак НЕиспользования категорий для объекта
		
		//планы закупок
		ТаблицаПолей.Очистить();
		
		СтрокаТаблицы = ТаблицаПолей.Добавить();
		СтрокаТаблицы.ПутьКДанным   = "ПланыЗакупокОбороты.Номенклатура";
		СтрокаТаблицы.Представление = "Номенклатура";
		СтрокаТаблицы.Назначение    = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура;
		
		СтрокаТаблицы = ТаблицаПолей.Добавить();
		СтрокаТаблицы.ПутьКДанным   = "ПланыЗакупокОбороты.ДокументПланирования";
		СтрокаТаблицы.Представление = "Контрагенты";
		СтрокаТаблицы.Назначение    = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты;
		
		СтрокаТаблицы = ТаблицаПолей.Добавить();
		СтрокаТаблицы.ПутьКДанным   = "ПланыЗакупокОбороты.ДокументПланирования";
		СтрокаТаблицы.Представление = "Документ планирования";
		СтрокаТаблицы.Назначение    = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы;
		
		ТекстПоляКатегорий = "";
		ТекстПоляСвойств = "";

		ДобавитьВТекстСвойстваИКатегорииЛокально(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, 
				ОбщийОтчет.мСоответствиеНазначений, ПостроительОтчета.Параметры
				,, ТекстПоляКатегорий, ТекстПоляСвойств,, "//СВОЙСТВА_ПЛАНЫЗАКУПОК", "//КАТЕГОРИИ_ПЛАНЫЗАКУПОК", "//СОЕДИНЕНИЯ_ПЛАНЫЗАКУПОК", "//СГРУППИРОВАТЬПО_ПЛАНЫЗАКУПОК", ОбщийОтчет.мСтруктураДляОтбораПоКатегориям);
		
		//фактические покупки		
		ТаблицаПолей.Очистить();
		
		СтрокаТаблицы = ТаблицаПолей.Добавить();
		СтрокаТаблицы.ПутьКДанным   = "ПартииТоваровНаСкладахОбороты.Номенклатура";
		СтрокаТаблицы.Представление = "Номенклатура";
		СтрокаТаблицы.Назначение    = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура;
		
		СтрокаТаблицы = ТаблицаПолей.Добавить();
		СтрокаТаблицы.ПутьКДанным   = "ПартииТоваровНаСкладахОбороты.ДокументОприходования.Контрагент";
		СтрокаТаблицы.Представление = "Контрагенты";
		СтрокаТаблицы.Назначение    = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты;
		
		СтрокаТаблицы = ТаблицаПолей.Добавить();
		СтрокаТаблицы.ПутьКДанным   = "ПартииТоваровНаСкладахОбороты.ДокументОприходования";
		СтрокаТаблицы.Представление = "Документ планирования, документ оприходования";
		СтрокаТаблицы.Назначение    = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы;
		
		ТекстПоляКатегорий = "";
		ТекстПоляСвойств = "";

		ДобавитьВТекстСвойстваИКатегорииЛокально(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, 
				ОбщийОтчет.мСоответствиеНазначений, ПостроительОтчета.Параметры
				,, ТекстПоляКатегорий, ТекстПоляСвойств,, "//СВОЙСТВА_ФАКТИЧЕСКИЕПОКУПКИ", "//КАТЕГОРИИ_ФАКТИЧЕСКИЕПОКУПКИ", "//СОЕДИНЕНИЯ_ФАКТИЧЕСКИЕПОКУПКИ", "//СГРУППИРОВАТЬПО_ФАКТИЧЕСКИЕПОКУПКИ", ОбщийОтчет.мСтруктураДляОтбораПоКатегориям);
				
		ДобавитьВТекстСвойстваОбщие(ТекстЗапроса, ТекстПоляСвойств, "//СВОЙСТВА_ОБЩИЕ");

	КонецЕсли;
	
	ПостроительОтчета.Текст = ТекстЗапроса;
	
	ПостроительОтчета.ДоступныеПоля.Номенклатура.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Номенклатура");
	
	Если Детализация = Перечисления.ДетализацияПланирования.НоменклатурныеГруппы Тогда
		МассивОтбора.Добавить("НоменклатурнаяГруппа");
		ПостроительОтчета.ДоступныеПоля.НоменклатурнаяГруппа.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы");
	Иначе
		МассивОтбора.Добавить("ХарактеристикаНоменклатуры");
	КонецЕсли;
	
	//ТипДанных в измерения колонки
	ИзмерениеТипДанных = ПостроительОтчета.ИзмеренияСтроки.Найти("ТипДанных");
	Если ИзмерениеТипДанных <> Неопределено Тогда
		ПутьКДанным = ИзмерениеТипДанных.ПутьКДанным;
		ТипИзмерения = ИзмерениеТипДанных.ТипИзмерения;
		ПостроительОтчета.ИзмеренияСтроки.Удалить(ИзмерениеТипДанных);
		ПостроительОтчета.ИзмеренияКолонки.Добавить(ПутьКДанным, , ТипИзмерения);
	КонецЕсли;
	
	Если ОбщийОтчет.ИспользоватьСвойстваИКатегории = Истина Тогда
		УстановитьТипыЗначенийСвойствИКатегорийДляОтбора(ПостроительОтчета, ТекстПоляКатегорий, ТекстПоляСвойств, ОбщийОтчет.мСоответствиеНазначений, СтруктураПредставлениеПолей);
	КонецЕсли;
	
	Если ОбщийОтчет.Показатели.Найти("Количество", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("Количество", "Количество (в единицах хранения)", Истина, "ЧЦ=15; ЧДЦ=3");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("Стоимость", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("Стоимость", "Сумма", Истина, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("КоличествоОтклонение", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("КоличествоОтклонение", "Отклонение количества (в единицах хранения)", Ложь, "ЧЦ=15; ЧДЦ=3");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("СтоимостьОтклонение", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("СтоимостьОтклонение", "Отклонение суммы", Ложь, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("КоличествоОтклонениеПроцент", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("КоличествоОтклонениеПроцент", "Отклонение количества %", Ложь, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("СтоимостьОтклонениеПроцент", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("СтоимостьОтклонениеПроцент", "Отклонение суммы %", Ложь, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("Количество", Новый Структура("ТипДанных"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("Стоимость", Новый Структура("ТипДанных"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("КоличествоОтклонение", Новый Структура("ТипДанных"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("СтоимостьОтклонение", Новый Структура("ТипДанных"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("КоличествоОтклонениеПроцент", Новый Структура("ТипДанных"));
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("СтоимостьОтклонениеПроцент", Новый Структура("ТипДанных"));
	
	ОбщийОтчет.мНазваниеОтчета = "План - фактный анализ закупок";
	
	ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
	
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения = Истина;
	
	// Установим дату начала отчета
	Если Не ЗначениеНеЗаполнено(глТекущийПользователь) Тогда
		ОбщийОтчет.ДатаНач = ПолучитьЗначениеПоУмолчанию(глТекущийПользователь,"ОсновнаяДатаНачалаОтчетов");
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь) Экспорт
	
	ВалютаУпр = ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(), ОбщийОтчет.ДатаКон);
	ВалютаРег = ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), ОбщийОтчет.ДатаКон);
	
	Если ВВалютеРегламентированногоУчета Тогда
		Коэффициент = (ВалютаУпр.Курс * ВалютаРег.Кратность) / (ВалютаРег.Курс * ВалютаУпр.Кратность);
	Иначе
		Коэффициент = 1;
	КонецЕсли;
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Коэффициент",  Коэффициент);
	
	Для каждого Данные из ДанныеОтчета Цикл
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ТипДанных" + Данные.НомерСтроки, ПолучитьПредставлениеДанных(Данные));
		Если Данные.ДатаНач = '00010101000000' И Данные.ДатаКон = '00010101000000' Тогда
			ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаНач" + Данные.НомерСтроки, ОбщийОтчет.ДатаНач);
			ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаКон" + Данные.НомерСтроки, ОбщийОтчет.ДатаКон);
		Иначе
			ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаНач" + Данные.НомерСтроки, Данные.ДатаНач);
			ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаКон" + Данные.НомерСтроки, Данные.ДатаКон);
		КонецЕсли;
	КонецЦикла;
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ПустаяСсылкаНоменклатурнаяГруппа", Справочники.НоменклатурныеГруппы.ПустаяСсылка());
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);
	
	Если ОбщийОтчет.ВыводитьПоказателиВСтроку Тогда
		
		РезультатПоиска = ДокументРезультат.НайтиТекст("Эталонный период");
		
		Если РезультатПоиска <> Неопределено Тогда
			
			УдаляемыеСтолбцы = Новый Массив;
			Индекс = 0;
			
			Для каждого Показатель из ОбщийОтчет.Показатели Цикл
				
				Если Показатель.Использование И
					(Показатель.Имя = "КоличествоОтклонение" ИЛИ
					Показатель.Имя = "СтоимостьОтклонение" ИЛИ
					Показатель.Имя = "КоличествоОтклонениеПроцент"
					ИЛИ Показатель.Имя = "СтоимостьОтклонениеПроцент") Тогда
					
					УдаляемыеСтолбцы.Добавить(РезультатПоиска.Лево + Индекс);
					
				КонецЕсли;
				
				Если Показатель.Использование Тогда
					
					Индекс = Индекс + 1;
					
				КонецЕсли;

			КонецЦикла;
			
			Индекс = УдаляемыеСтолбцы.Количество() - 1;
			
			Пока Индекс >= 0 Цикл
				
				УдаляемаяОбласть = ДокументРезультат.Область(, УдаляемыеСтолбцы[Индекс],, УдаляемыеСтолбцы[Индекс]);
				ДокументРезультат.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				
				Индекс = Индекс - 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПРоцедуры

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ВВалютеРегламентированногоУчета = Параметры["ЭтотОтчет"].ВВалютеРегламентированногоУчета;
	Детализация = Параметры["ЭтотОтчет"].Детализация;
	ДанныеОтчета.Загрузить(Параметры["ЭтотОтчет"].ДанныеОтчета.Выгрузить());
	
	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет=Неопределено) Экспорт
	
	// Если отчет, вызвавший порцедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры
